{
    "recipes": [

        {
            "id": 1,
            "title": "Asparagus risotto",
            "author": " Barney Desmazery",
            "preparationtime": "10 mins",
            "cookingtime": "25 mins",
            "complexity": "Easy",
            "serves": 2,
            "description": "Put asparagus centre stage in this satisfying risotto. Top with a sprinkling of parmesan for an easy midweek meal for two",
            "ratings":26,
            "nutritionperserving": {
                "kcal":623,
                "fat":22,
                "saturates":10,
                "carbs":80,
                "sugars":8,
                "fibre":6,
                "protein":15,
                "salt":1.5
            },
            "ingredients": [ "1 bunch asparagus (about 200g)","800ml vegetable stock","1 tbsp olive oil","25g butter","1 small onion , finely chopped","175g risotto rice","100ml white wine or vermouth (optional)","25g parmesan or vegetarian alternative, finely grated"],
            "steps": ["Snap the woody ends off the asparagus stalks and tip them into a saucepan with the stock. Put on a low heat to very gently simmer. Meanwhile, cut off the tips of the asparagus, add to the stock for exactly 1 min. Scoop out with a slotted spoon and set aside. Finely slice the rest of the stalks into rounds.","Heat the oil and half the butter in a heavy, wide pan. Cook the onions gently for 5 mins until soft, stirring often. Add the chopped asparagus stalks and cook for 2 mins more. Add the rice and continously stir for a few minutes until it turns semi-transparent and makes a hissing sound.","Stir in the wine, if using – it will evaporate almost immediately. Reduce the heat to a gentle simmer. Add the stock, a ladleful at a time, stirring between each addition until it is absorbed, about 15 mins.","Try the rice – it should feel just cooked with a slight bite to it. Stir in the asparagus tips and any last dregs of stock and cook for 1 or 2 mins more. Remove from the heat and top with the remaining butter and most of the parmesan. Season generously, cover and leave for a few minutes to settle.","Give the risotto a thorough stir to incorporate the butter and cheese and serve straight away with the remaining parmesan for sprinkling over."],
            "image":"RecipeIcons/aspargusrisotto.png"
            
        },
        {
            "id":2,
            "title": "Healthy pasta primavera",
            "author":" Good Food team",
            "preparationtime": "10 mins",
            "cookingtime": "20 mins",
            "complexity": "Easy",
            "serves": 4,
            "description": "A healthy spaghetti dish full of broad beans, leeks and asparagus tips. Make the most of spring greens with this vibrant, filling pasta recipe",
            "ratings":53,
            "nutritionperserving":{
                "kcal":476,
                "fat":9,
                "saturates":3,
                "carbs":74,
                "sugars":6,
                "fibre":9,
                "protein":20,
                "salt":0.1
            },
            "ingredients":["75g young broad beans (use frozen if you can't get fresh)","2 x 100g pack asparagus tips","170g peas (use frozen if you can't get fresh)","350g spaghetti or tagliatelle","175g pack baby leeks , trimmed and sliced","1 tbsp olive oil , plus extra to serve","1 tbsp butter","200ml tub fromage frais or creme fraiche","handful fresh chopped herbs (we used mint, parsley and chives)","parmesan (or vegetarian alternative), shaved, to serve"],
            "steps":["Bring a pan of salted water to the boil and put a steamer (or colander) over the water. Steam the beans, asparagus and peas until just tender, then set aside. Boil the pasta following pack instructions.","Meanwhile, fry the leeks gently in the oil and butter for 5 mins or until soft. Add the fromage frais to the leeks and very gently warm through, stirring constantly to ensure it doesn’t split. Add the herbs and steamed vegetables with a splash of pasta water to loosen.","Drain the pasta and stir into the sauce. Adjust the seasoning, then serve scattered with the cheese and drizzled with a little extra olive oil."],
            "image":"RecipeIcons/healthypastaprimaver.png"
        },
        {
            "id":3,
            "title": "One-pan salmon with roast asparagus",
            "author": "Barney Desmazery",
            "preparationtime": "20 mins",
            "cookingtime":"50 mins",
            "complexity":"Easy",
            "serves": 2,
            "description": "For an easy side dish to complement a spring roast, just cook this recipe without the salmon",
            "ratings":471,
            "nutritionperserving":{
                "kcal": 483,
                "fat": 25,
                "saturates": 4,
                "carbs": 34,
                "sugars": 6,
                "fibre": 3,
                "protein": 33,
                "salt":0.24
            },
            "ingredients":["400g new potato, halved if large","2 tbsp olive oil","8 asparagus spears, trimmed and halved","2 handfuls cherry tomatoes","1 tbsp balsamic vinegar","2 salmon fillets, about 140g/5oz each","handful basil leaves"],
            "steps":["Heat oven to 220C/fan 200C/gas 7. Tip the potatoes and 1 tbsp of olive oil into an ovenproof dish, then roast the potatoes for 20 mins until starting to brown. Toss the asparagus in with the potatoes, then return to the oven for 15 mins.", "Throw in the cherry tomatoes and vinegar and nestle the salmon amongst the vegetables. Drizzle with the remaining oil and return to the oven for a final 10-15 mins until the salmon is cooked. Scatter over the basil leaves and serve everything scooped straight from the dish."],
            "image":"RecipeIcons/Onepansalmonwithroastasparagus.png"
        },
        {
            "id":4,
            "title": "Nettle spanakopita",
            "author": "Barney Desmazery",
            "preparationtime": "20 mins",
            "cookingtime": "50 mins",
            "complexity": "Easy",
            "serves":6,
            "description": "Using nettles instead of spinach gives the classic spanakopita a spring time twist. Young nettles are a sweet, nutritious and free alternative to spinach",
            "ratings": 8,
            "nutritionperserving": {
                "kcal":421,
                "fat":26,
                "saturates":15,
                "carbs":30,
                "sugars":2,
                "fibre":4,
                "protein":15,
                "salt":1.8
            },
            "ingredients": ["150g nettle leaves","100g butter , 25g solid, 75g melted","200g feta , crumbled","50g parmesan , finely grated","1 lemon , zested and juiced","1 egg , beaten","grated nutmeg","7 sheets filo pastry","1 tbsp sesame seeds","green salad , to serve"],
            "steps": ["For the filling, wash the nettles well but don’t drain them too thoroughly. Heat the solid butter in a large frying pan. When it’s sizzling and has turned a nutty brown, add the nettles and cook for about 6 mins until wilted. Leave to cool.","Using a tea towel, squeeze as much liquid out of the nettles as you can, then roughly chop and tip into a bowl. Mix in the feta, parmesan, lemon zest and juice, about two-thirds of the egg and some nutmeg, and season generously. The filling should be loose but not sloppy.","Heat oven to 200C/180C fan/gas 6. To assemble the spanakopita, lay three sheets of filo end-to-end on your work surface, overlapping by about 5cm. Brush each piece with melted butter and top with three more sheets, then brush with more butter and add the final sheet to the middle for extra support. Spoon the nettle mix along the edge, about 2cm wide, and tuck over the short ends to stop any filling from coming out. Roll the pastry into a long sausage shape. Starting with one end, roll up the sausage into a spiral shape about 20cm wide. Put the spanakopita in a shallow round pan, like an ovenproof frying pan, if it fits. If not, slide it onto a buttered baking tray.","Brush the pie liberally with the remaining egg and scatter with the sesame seeds. Bake for 40-45 mins or until golden brown. Leave to cool until just warm, then serve in slices with a peppery salad."],
            "image": "RecipeIcons/spanakopita.png"
        },
       {
            "id":5,
            "title": "Spring chicken in a pot",
            "author": "Mary Cadogan",
            "preparationtime":"20 mins",
            "cookingtime":"45 mins",
            "complexity": "Easy",
            "serves":4,
            "description": "Casseroles aren't just for winter – this light, vibrant one-pot is packed with spring veg and herby pesto",
            "ratings":261,
            "nutritionperserving": {
                "kcal":339,
                "fat":10,
                "saturates":3,
                "carbs":27,
                "sugars":12,
                "fibre":8,
                "protein":36,
                "salt":0.5
            },
            "ingredients":["1 tbsp olive oil","1 onion , chopped","500g boneless, skinless chicken thigh","300g small new potato","425ml low-salt vegetable stock (such as Kallo low-salt vegetable stock cubes)","350g broccoli , cut into small florets","350g spring green , shredded","140g petits pois","bunch spring onion , sliced","2 tbsp pesto"],
            "steps":["Heat the oil in a large, heavy pan. Add the onion, gently fry for 5 mins until softened, add the chicken, then fry until lightly coloured. Add the potatoes, stock and plenty of freshly ground black pepper, then bring to the boil. Cover, then simmer for 30 mins until the potatoes are tender and the chicken is cooked. Can be frozen at this point.","Add the broccoli, spring greens, petit pois and spring onions, stir well, then return to the boil. Cover, then cook for 5 mins more, stir in the pesto and heat through."],
            "image":"RecipeIcons/Springchickeninapot.png"
       },
       {
           "id":6,
           "title":"Pea, mint & spring onion soup with parmesan biscuits",
           "author": "Good Food team",
           "preparationtime":"20 mins",
           "cookingtime": "25 mins",
           "complexity": "Easy",
           "serves": 6,
           "description": "The parmesan 'tuiles' make this soup stylish enough for entertaining – but they take just a few minutes to make",
           "ratings":49,
           "nutritionperserving":{
                "kcal":213,
                "fat":9,
                "saturates":4,
                "carbs":20,
                "sugars":8,
                "fibre":8,
                "protein":15,
                "salt":0.27
           },
           "ingredients":["1 tbsp olive oil","knob of butter","½ bunch spring onion , sliced, plus a few extra to serve","1 potato , cut into small dice","1l hot vegetable stock","900g frozen petits pois","½ small bunch mint , leaves picked, plus a few extra to serve","85g parmesan (or vegetarian alternative), very finely grated"],
           "steps":["Heat the olive oil and butter in a heavy based pan. When foaming, add the spring onions and potato. Gently fry without colouring for about 5 mins. Stir in the stock, bring to the boil and simmer for 10 mins or until the potato is tender.","Stir in the peas, bring to the boil again, then cook for about 3 mins until they are just done. Remove the pan from the heat, add the mint leaves and whizz in a blender or food processor until smooth.","To make the parmesan biscuits, heat the grill to high. Line a baking sheet with baking parchment and divide the grated parmesan into 6 long strips. Grill for 1 min or until the cheese has melted and is lightly golden. While still warm and a bit flexible, release the biscuits from the baking parchment with a palette or cutlery knife, then cool until firm.","To serve, heat the soup and divide between 6 bowls. Scatter with mint and sliced spring onions, if you like, and serve with the parmesan biscuits on the side."],
           "image":"RecipeIcons/Peamint&springonionsoupwithparmesanbiscuits.png"
        },
        {
            "id":7,
            "title": "Pea & broad bean shakshuka",
            "author": " Lulu Grimes",
            "preparationtime":"20 mins",
            "cookingtime":"30 mins",
            "complexity": "Easy",
            "serves": 4,
            "description": "We’ve turned a classic brunch shakshuka dish into more of a sharing main course by adding seasonal spring vegetables like peas, broad beans and asparagus",
            "ratings": 29,
            "nutritionperserving":{
                "kcal":199,
                "fat":12,
                "saturates":2,
                "carbs":7,
                "sugars":5,
                "fibre":7,
                "protein":13,
                "salt":0.2
            },
            "ingredients": ["1 bunch asparagus spears","200g sprouting broccoli","2 tbsp olive oil","2 spring onions , finely sliced","2 tsp cumin seeds","large pinch cayenne pepper , plus extra to serve","4 ripe tomatoes , chopped","1 small pack parsley , finely chopped","50g shelled peas","50g podded broad beans","4 large eggs","50g pea shoots","Greek yogurt and flatbreads, to serve"],
            "steps": ["Trim or snap the woody ends of the asparagus and finely slice the spears, leaving the tips and about 2cm at the top intact. Finely slice the broccoli in the same way, leaving the heads and about 2cm of stalk intact. Heat the oil in a frying pan. Add the spring onions, sliced asparagus and sliced broccoli, and fry gently until the veg softens a little, then add the cumin seeds, cayenne, tomatoes (with their juices), parsley and plenty of seasoning, and stir. Cover with a lid and cook for 5 mins to make a base sauce, then add the asparagus spears, broccoli heads, peas and broad beans, cover again and cook for 2 mins.","Make 4 dips in the mixture. Break an egg into each dip, arrange half the pea shoots around the eggs, season well, cover with a lid and cook until the egg whites are just set. Serve with the rest of the pea shoots, a spoonful of yogurt and some flatbreads, and sprinkle over another pinch of cayenne, if you like."],
            "image":"RecipeIcons/peashakshuka.png"
        },
        {
            "id":8,
            "title":"Fruity lamb tagine",
            "author":"Barney Desmazery",
            "preparationtime": "15 mins",
            "cookingtime":"90 mins",
            "complexity":"Easy",
            "serves":4,
            "description": "This succulent and superhealthy one-pot is guaranteed to satisfy a crowd - save time and make it up to two days ahead",
            "ratings": 249,
            "nutritionperserving":{
                "kcal":497,
                "fat":18,
                "saturates":5,
                "carbs":46,
                "sugars":32,
                "fibre":12,
                "protein":40,
                "salt":1.37
            },
            "ingredients":["2 tbsp olive oil","500g lean diced lamb","1 large onion, roughly chopped","2 large carrots, quartered lengthways and cut into chunks","2 garlic cloves, finely chopped","2 tbsp ras-el-hanout spice mix","400g can chopped tomato","400g can chickpea, rinsed and drained","200g dried apricot","600ml chicken stock","120g pack pomegranate seeds","2 large handfuls coriander, roughly chopped"],
            "steps":["Heat oven to 180C/160C fan/gas 4. Heat the oil in a casserole and brown the lamb on all sides. Scoop the lamb out onto a plate, then add the onion and carrots and cook for 2-3 mins until golden. Add the garlic and cook for 1 min more. Stir in the spices and tomatoes, and season. Tip the lamb back in with the chickpeas and apricots. Pour over the stock, stir and bring to a simmer. Cover the dish and place in the oven for 1 hr.","If the lamb is still a little tough, give it 20 mins more until tender. When ready, leave it to rest so it’s not piping hot, then serve scattered with pomegranate and herbs, with couscous or rice alongside."],
            "image":"RecipeIcons/Fruitylambtagine.png"
        },
        {
            "id":9,
            "title": "Slow-cooked rabbit stew",
            "author": " Good Food team",
            "preparationtime":"25 mins",
            "cookingtime": "130 mins",
            "complexity":"Easy",
            "serves":4,
            "description":"This is a true taste of autumn, a big bowl of rich, dark, boozy rabbit casserole",
            "ratings": 39,
            "nutritionperserving":{
                "kcal":607,
                "fat":21,
                "saturates":7,
                "carbs":36,
                "sugars":31,
                "fibre":4,
                "protein":61,
                "salt":1.12
            },
            "ingredients": ["140g prune","50ml brandy","50g soft brown sugar","2 rabbits, jointed","plain flour, for dusting","1 tbsp vegetable oil","3 rashers smoked streaky bacon, sliced into thin strips","2 carrots, chopped","1 onion, chopped","2 celery sticks, chopped","1 garlic clove, crushed","2 thyme sprigs","1 bay leaf","150ml red wine, the best you can afford","250ml chicken stock","chopped parsley and wild rice, to serve"],
            "steps":["Heat oven to 150C/130C fan/gas 2. Put the prunes in a bowl with the brandy and brown sugar, stir, then set aside to soak.","Dust the rabbit in the flour. Heat the oil in a large flameproof dish and brown the rabbit all over until golden – you may have to do this in batches. Set the rabbit aside. Add the bacon, vegetables, garlic and herbs to the dish and fry for 5 mins until starting to colour.","Pour in the red wine and scrape all the goodness off the bottom of the dish. Add the chicken stock and put the rabbit back in the dish with the boozy prunes, then cover and cook for 2 hrs, stirring occasionally, until the rabbit is totally tender. Serve scattered with parsley and wild rice on the side."],
            "image":"RecipeIcons/Slowcookedrabbitstew.png"
        },
        {
            "id":10,
            "title": "Steak supper for two or more",
            "author":"Good Food team",
            "preparationtime":"10 mins",
            "cookingtime":"150 mins",
            "complexity":"Easy",
            "serves":2,
            "description":"End the day with this special steak supper",
            "ratings": 20,
            "nutritionperserving":{
                "kcal":463,
                "fat":15,
                "saturates":4,
                "carbs":45,
                "sugars":10,
                "fibre":5,
                "protein":39,
                "salt":0.32
            },
            "ingredients":["1 tbsp olive oil","x braising steaks , trimmed of fat","2 garlic cloves , crushed","1 onion , thinly sliced","4 tomatoes , thinly sliced","2 large potatoes , peeled and thinly sliced"],
            "steps":["Heat oven to 180C/fan 160C/gas 4. Drizzle half the oil into a small casserole or pie dish and rub all over, then place one steak inside. Scatter over some of the garlic, followed by a layer of onion and tomatoes, then a layer of potatoes on top. Season, then repeat the layers, finishing with the potato.","Drizzle with the remaining oil and then cover the casserole with a tightly fitting lid or cover the pie dish with a double layer of foil. Transfer to the oven for 2 hrs. Remove the lid or foil, turn the oven up to 220C/fan 200C/gas 7 and cook for 30 mins more until the top is golden brown. Serve with some green vegetables."],
            "image":"RecipeIcons/Steaksupperfortwoormore.png"
        }


             
    ]


}